


a = "Шляпка гриба, покрытая ... пленкой, держится на ножк... .Снизу шляпка затянута ... пленкой. Когда её уберёшь, откроется нижняя сторона шляпк..."
print(a)
b=input('Введите слово для первого пропуска : ')

if b == 'тонкой':
    print('Превосходно!')
else :
    print('Неверно')
    
ab = input('Введите слово для второго пропуска : ')
if ab == "ке":
    print('Замечательно!')
else :
    print('Неверно')
    
x=input('Введите слово для третьего пропуска : ')
if x == 'тонкой':
    print('Молодец!')
else :
    print('Неверно')
    
g=input('Введите слово для четвертого пропуска : ')
if g == 'и':
    print('Отлично!')
else :
    print('Неверно')
    
print(f'Проверьте правильность ваших ответов: Шляпка гриба, покрытая  тонкой  кожицей, держится на ножке .Снизу шляпка затянута тонкой  пленкой .Когда её уберёшь ,откроется нижняя сторона шляпки')

